---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.RevolutionFailures
source: html/8a5ea483-6949-0745-7d43-12cc41988e11.htm
---
# BuiltInFailures.RevolutionFailures Properties

Can't create surface of revolution.